# MPG Cars

### Introduction:



### Step 1. Import the necessary libraries

In [18]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

In [5]:
cars1 = pd.read_csv('cars1(Merge).csv')
cars2 = pd.read_csv('cars2(Merge).csv')

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [20]:
cars1 = pd.read_csv('cars1(Merge).csv')
cars2 = pd.read_csv('cars2(Merge).csv')

In [22]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [24]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [40]:
blank = cars1.dropna(axis = 1, how = 'all')
blank.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [42]:
cars1.shape

(198, 9)

In [44]:
cars2.shape

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [60]:
cars = pd.concat([cars1, cars2], ignore_index = False)
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [52]:
num_rows = len(cars)
owners = np.random.randint(low = 15000, high = 73000, size = num_rows)
owners

array([37771, 27716, 37890, 18238, 49338, 34317, 62188, 70740, 54238,
       34764, 27434, 55889, 47503, 44803, 66694, 15005, 59078, 25767,
       39517, 42871, 22972, 57481, 67920, 15512, 25636, 58541, 60424,
       38800, 15148, 26746, 18674, 43324, 47141, 48838, 47096, 49234,
       68163, 28182, 17115, 23308, 32677, 70588, 44126, 36345, 18366,
       42900, 42781, 43854, 35080, 19201, 52651, 25840, 43828, 60128,
       50519, 25570, 39876, 62899, 42030, 45067, 36108, 39172, 30757,
       25401, 69763, 53490, 20686, 40681, 68926, 51793, 61216, 54926,
       52088, 24209, 49486, 50427, 30491, 57847, 69495, 34228, 26717,
       15149, 17448, 21600, 59447, 35174, 19149, 34160, 52645, 47472,
       27663, 51668, 40942, 66505, 46816, 61988, 44819, 50107, 58305,
       32754, 35052, 72517, 31902, 41970, 52212, 25037, 67531, 26453,
       65835, 31172, 20341, 36363, 15970, 26241, 46012, 42384, 49753,
       58102, 44707, 24234, 19357, 62137, 21640, 32675, 23775, 43354,
       63714, 20204, 70135, 46381, 46267, 69963, 57434, 19081, 50463,
       35835, 43028, 64267, 59124, 65667, 56445, 52297, 34138, 17610,
       17776, 65885, 19947, 69156, 59304, 35605, 24826, 26450, 16636,
       46402, 64648, 37132, 57826, 71944, 26952, 16960, 58919, 32774,
       62078, 67444, 72844, 40583, 55205, 15218, 25985, 66767, 55895,
       60995, 38076, 28977, 42944, 29242, 56403, 53725, 24318, 35805,
       66414, 54315, 60241, 47912, 64952, 39645, 22253, 69962, 42854,
       34840, 28513, 20733, 32794, 37357, 28165, 23476, 65734, 65938,
       69320, 41043, 25431, 67989, 43050, 70999, 30859, 21746, 72810,
       66059, 53418, 64078, 67582, 15289, 21835, 32139, 48894, 72219,
       23257, 61250, 71434, 64585, 28544, 44937, 47724, 20299, 34868,
       28035, 20046, 36852, 54908, 53370, 37641, 26941, 62881, 53426,
       18685, 38799, 17577, 22304, 20600, 53555, 45214, 45012, 67892,
       29463, 70965, 25463, 69545, 66247, 58855, 60290, 58110, 32694,
       46647, 50303, 61942, 62743, 19537, 54610, 16595, 66477, 60823,
       40099, 44026, 19633, 45896, 37037, 35347, 47924, 25313, 53917,
       71757, 59108, 53960, 39717, 53543, 38886, 67041, 29963, 67434,
       25018, 65728, 59759, 67192, 23305, 27481, 66338, 31304, 22266,
       36065, 20541, 59876, 69425, 42503, 18659, 29723, 36205, 65710,
       37045, 69583, 38048, 27772, 54637, 44801, 64427, 15121, 59504,
       24303, 40819, 25682, 44625, 19229, 72052, 63142, 34734, 62686,
       25492, 72494, 51093, 48544, 45501, 15779, 68513, 51875, 33953,
       64539, 33524, 63440, 34052, 28223, 71842, 68472, 32786, 32947,
       33031, 19742, 38599, 64406, 68470, 68301, 59403, 23368, 52425,
       58044, 71791, 44018, 29219, 70238, 41664, 50274, 23369, 44884,
       33063, 36431, 39026, 17117, 21911, 41453, 54872, 54535, 39357,
       31817, 17824, 62041, 68747, 21536, 65793, 31437, 26197, 21856,
       49337, 39036, 72248, 70088, 22463, 33306, 50227, 59577, 45439,
       71033, 50417, 57197, 55645, 35321, 31219, 22343, 62862, 61336,
       59449, 34733, 63312, 39811, 68373, 27573, 36833, 27281, 52138,
       58247, 55317])

### Step 8. Add the column owners to cars

In [62]:
cars['owners'] = owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,37771
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,27716
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,37890
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,18238
4,17.0,8,302,140,3449,10.5,70,1,ford torino,49338